Revit 2027 API
ModuleSettings Constructor
 Constructs a new module settings.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModuleSettings(
	string name,
	MacroLanguageType macroLanguageType
)
Public Sub New (
	name As String,
	macroLanguageType As MacroLanguageType
)
public:
ModuleSettings(
	String^ name,
	MacroLanguageType macroLanguageType
)
new :
        name : string *
        macroLanguageType : MacroLanguageType -> ModuleSettings
Parameters
name String
 The module name.
macroLanguageType MacroLanguageType
 The Macro language type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace